{
  "app_title": "Fashion meets Computer Science and Natural Language Processing",
  "app_description_para_1": "In this demo we show our latest developments in multimodal (visual-textual) search within the fashion domain.  Our algorithms allow machines to perform two challenging tasks. First, given a textual query without any visual information, our system finds images that display the visual properties in the query. Secondly, given a query image without any supplementing text, our system generates text that describes the visual properties in the image. For these tasks we show our results below. Remarkably, images shown in the results below correspond to items that our algorithm has never seen before.",
  "app_description_para_2": "Our system may be useful to e-commerce sites who may wish to automatically organizing an image collection according to its visual attributes. In this case, our system can automatically annotate the images with relevant visual properties.  It may be useful for end users, who may write a query to indicate the visual attributes they wish to find in a garment. The algorithm is able to retrieve product images that display such attributes, without relying on textual meta-data on the image to match against the textual query.",
  "app_description_para_3": "",

  "app_description_footer": "Language Intelligence & Information Retrieval (LIIR) research team",
  "app_description_weblink": "http://liir.cs.kuleuven.be/",

  "rawdata_title": "Training Data",
  "rawdata_description": "Our system is trained using fashion products found on the Web, on a famous e-commerce site. During training we  build a model that captures associations between visual and textual pairs.  We then test the model in the true multimodal search, as described in the tasks above.",

  "txt2img_title": "Text to Image",
  "txt2img_description": "Given a textual query without any visual information, our system finds images that display the visual properties in the query.",

  "img2txt_title": "Image to Text",
  "img2txt2_description": "Given a query image without any surrounding text, our system generates text that describes the visual properties in the image. In the demo we also compare words generated by our algorithm with the ones that were mentioned in the original product description on the source websites of the images.",

  "find_similar_images_title": "Find Similar Images",
  "find_similar_images_description": "Given a query image we try to find similar images",

  "__COMMENT1__": "THE FOLLOWING ARE FOR SETTING SUB-TITLES IN THE IMAGE-2-TEXT SCREEN",
  "img2txt_original_words_title": "Original product description.",
  "img2txt_predicted_words_title": "Words predicted by our algorithm"
}